js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
/* Chunked quad-read: split LEN_TOTAL into CHUNK_SIZE-byte MDMA reads,
 * each issued at flash addr = chunk_idx * CHUNK_SIZE so the slave's
 * test pattern restarts at the correct seed for every chunk. The
 * stitched DDR buffer is then validated against the expected
 * incrementing pattern and a CRC32 + first-error scan is reported in
 * the same shape as `m`/`stream`. Only the quad path (opcode 0x6B,
 * dummy_cycles=9) is exposed -- this command exists to bypass the
 * 80-byte boundary corruption observed at high prescalers, by keeping
 * each individual MDMA burst entirely inside the clean window. */
static void cmd_chunked(int argc, char **argv)
{
   uint32_t len_total  = arg_u32(argc > 0 ? argv[0] : NULL, 4096U);
   uint32_t chunk_size = arg_u32(argc > 1 ? argv[1] : NULL, 64U);
   uint32_t dummy      = arg_u32(argc > 2 ? argv[2] : NULL, 9U);
   uint32_t opcode_arg = arg_u32(argc > 3 ? argv[3] : NULL, 0x6BU);
   if (len_total == 0U || chunk_size == 0U) {
      my_printf("ERR chunked: nonzero LEN and CHUNK required\r\n");
      return;
   }
   if (chunk_size & 0x3U) {
      my_printf("ERR chunked: CHUNK must be 4-byte aligned\r\n");
      return;
   }
   if (len_total % chunk_size != 0U) {
      my_printf("ERR chunked: LEN must be multiple of CHUNK\r\n");
      return;
   }
   busy_flag = true;

   const uint8_t opcode = (uint8_t)opcode_arg;
   const qspi_lines_t dl = QSPI_LINES_4;
   const uint32_t dst   = DEF_DDR_BASE;
   volatile uint8_t *const p = (volatile uint8_t *)dst;
   const uint32_t n_chunks = len_total / chunk_size;

   my_printf("chunked_begin %lu B chunk=%lu n=%lu dummy=%lu\r\n",
             (unsigned long)len_total,
             (unsigned long)chunk_size,
             (unsigned long)n_chunks,
             (unsigned long)dummy);

   const uint32_t t0 = HAL_GetTick();
   HAL_StatusTypeDef s = HAL_OK;
   for (uint32_t i = 0U; i < n_chunks; i++) {
      const uint32_t flash_addr = (i * chunk_size) & 0x00FFFFFFU;
      const uint32_t buf_off    = i * chunk_size;
      s = qspi_mdma_read_addr(opcode, dl, (uint8_t)dummy, chunk_size,
                              false, flash_addr, dst + buf_off,
                              5000U, true);
      if (s != HAL_OK) {
         my_printf("ERR chunked at idx=%lu addr=%lu (%d)\r\n",
                   (unsigned long)i, (unsigned long)flash_addr, (int)s);
         busy_flag = false;
         return;
      }
   }
   const uint32_t xfer_ms = HAL_GetTick() - t0;

   /* Hex dump first 32 bytes for diagnostic */
   my_printf("HEX[0..31]:");
   for (uint32_t k = 0; k < 32U && k < len_total; k++)
      my_printf(" %02x", (unsigned)p[k]);
   my_printf("\r\n");
   /* Hex dump bytes around chunk boundary 1 */
   if (len_total >= chunk_size + 32U) {
      my_printf("HEX[%lu..%lu]:", (unsigned long)(chunk_size - 4U),
                (unsigned long)(chunk_size + 31U));
      for (uint32_t k = chunk_size - 4U; k < chunk_size + 32U; k++)
         my_printf(" %02x", (unsigned)p[k]);
      my_printf("\r\n");
   }

   /* Validate stitched buffer. Pattern depends on opcode:
    *   0x6B: incrementing byte ramp i & 0xFF
    *   0x6F at dummy=9: nibble-ramp byte cycle 01 23 45 67 89 AB CD EF */
   static const uint8_t ramp_pattern[8] = {0x01, 0x23, 0x45, 0x67,
                                            0x89, 0xAB, 0xCD, 0xEF};
   const uint32_t validate_t0 = HAL_GetTick();
   uint32_t crc       = 0xFFFFFFFFUL;
   uint32_t first_err = 0xFFFFFFFFUL;
   for (uint32_t i = 0; i < len_total; i++) {
      const uint8_t b = p[i];
      crc ^= (uint32_t)b;
      for (int j = 0; j < 8; j++)
         crc = (crc >> 1) ^ (0xEDB88320UL & (-(int32_t)(crc & 1U)));
      uint8_t exp;
      if (opcode == 0x6FU)
         exp = ramp_pattern[i & 7U];
      else
         exp = (uint8_t)(i & 0xFFU);
      if (b != exp && first_err == 0xFFFFFFFFUL)
         first_err = i;
   }
   crc ^= 0xFFFFFFFFUL;
   const uint32_t validate_ms = HAL_GetTick() - validate_t0;

   uint32_t dt = xfer_ms;
   if (dt == 0U) dt = 1U;
   uint32_t mbps_x10;
   if (len_total <= 50000000U)
      mbps_x10 = (len_total * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len_total / 1000U) * 80U) / dt;

   const long firsterr_signed =
       (first_err == 0xFFFFFFFFU) ? -1L : (long)first_err;
   my_printf("chunked %lu B chunk=%lu n=%lu in %lu ms, %lu.%lu Mbps, "
             "crc32=%08lx, firsterr=%ld, "
             "xfer=%lu ms, validate=%lu ms, dummy=%lu, presc=%lu, "
             "op=%02lx\r\n",
             (unsigned long)len_total,
             (unsigned long)chunk_size,
             (unsigned long)n_chunks,
             (unsigned long)dt,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U),
             (unsigned long)crc,
             firsterr_signed,
             (unsigned long)xfer_ms,
             (unsigned long)validate_ms,
             (unsigned long)dummy,
             (unsigned long)qspi_get_prescaler(),
             (unsigned long)opcode);
   busy_flag = false;
}

static void cmd_poison(int argc, char **argv)
{
   uint32_t len = arg_u32(argc > 0 ? argv[0] : NULL, 4096U);
   if (len == 0U)
      len = 4096U;
   if (len & 0x3U) {
      my_printf("ERR poison: len must be 4-byte aligned\r\n");
      return;
   }
   busy_flag = true;
   volatile uint8_t *const p = (volatile uint8_t *)DEF_DDR_BASE;
   const uint32_t t0 = HAL_GetTick();
   for (uint32_t i = 0; i < len; i++)
      p[i] = (uint8_t)(~i & 0xFFU);
   __asm volatile("dsb sy" ::: "memory");
   const uint32_t dt = HAL_GetTick() - t0;
   my_printf("poison %lu B in %lu ms\r\n",
             (unsigned long)len, (unsigned long)dt);
   busy_flag = false;
}

static void cmd_xor_time(int argc, char **argv)
{
   uint32_t iters = arg_u32(argc > 0 ? argv[0] : NULL, 1000U);
   if (iters == 0U)
      iters = 1U;

   volatile uint32_t *const p = (volatile uint32_t *)DEF_DDR_BASE;
   const uint32_t words = STREAM_XOR_BYTES / sizeof(uint32_t);
   uint32_t x = 0U;

   busy_flag = true;
   for (uint32_t i = 0U; i < words; i++)
      p[i] = pattern_word(i * 4U);
   __asm volatile("dsb sy" ::: "memory");

