js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
static void cmd_chip_erase_pending(void)
{
   pend_confirm_C_until = HAL_GetTick() + 2000U;
   my_printf("Type C again to confirm.\r\n");
}

static void cmd_chip_erase_do(void)
{
   const qspi_cmd_t c = {
      .instruction = 0xC7U, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 1000U) != HAL_OK) {
      my_printf("ERR chip\r\n");
      return;
   }
   my_printf("op=c7 erased chip\r\n");
}

static void cmd_autopoll(int argc, char **argv)
{
   uint32_t opc   = arg_u32(argc > 0 ? argv[0] : NULL, 0x05U);
   uint32_t mask  = arg_u32(argc > 1 ? argv[1] : NULL, 0x01U);
   uint32_t match = arg_u32(argc > 2 ? argv[2] : NULL, 0x00U);
   const qspi_cmd_t c = {
      .instruction = (uint8_t)opc,
      .inst_lines  = QSPI_LINES_1,
      .data_lines  = QSPI_LINES_1,
      .data_len    = 1U,
   };
   busy_flag = true;
   uint32_t t0 = HAL_GetTick();
   HAL_StatusTypeDef s = qspi_autopoll(&c, mask, match, 16U, 5000U);
   uint32_t dt = HAL_GetTick() - t0;
   busy_flag = false;
   if (s == HAL_OK)
      my_printf("autopoll op=%02x mask=%02lx match=%02lx done in %lu ms\r\n",
                (unsigned)opc, (unsigned long)mask, (unsigned long)match,
                (unsigned long)dt);
   else
      my_printf("autopoll TIMEOUT after %lu ms\r\n", (unsigned long)dt);
}

static void cmd_4byte(int argc, char **argv)
{
   bool enter;
   if (argc > 0)
      enter = arg_u32(argv[0], 0U) != 0U;
   else
      enter = !four_byte_mode;
   uint8_t opc = enter ? 0xB7U : 0xE9U;
   const qspi_cmd_t c = {
      .instruction = opc, .inst_lines = QSPI_LINES_1,
   };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR 4byte\r\n");
      return;
   }
   four_byte_mode = enter;
   my_printf("4byte=%d (op=%02x)\r\n", enter ? 1 : 0, (unsigned)opc);
}

static void cmd_reset(void)
{
   const qspi_cmd_t a = { .instruction = 0x66U, .inst_lines = QSPI_LINES_1 };
   const qspi_cmd_t b = { .instruction = 0x99U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&a, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK ||
       qspi_xfer(&b, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR reset\r\n");
      return;
   }
   my_printf("reset (66 99) sent\r\n");
}

static void cmd_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xB9U, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR dpd\r\n");
      return;
   }
   my_printf("op=b9 deep power-down\r\n");
}

static void cmd_release_dpd(void)
{
   const qspi_cmd_t c = { .instruction = 0xABU, .inst_lines = QSPI_LINES_1 };
   if (qspi_xfer(&c, QSPI_FMODE_WRITE, NULL, 100U) != HAL_OK) {
      my_printf("ERR rdpd\r\n");
      return;
   }
   my_printf("op=ab release DPD\r\n");
}

static void cmd_prescaler(int argc, char **argv)
{
   uint32_t p = arg_u32(argc > 0 ? argv[0] : NULL, qspi_get_prescaler());
   if (p > 255U) {
      my_printf("ERR presc range\r\n");
      return;
   }
   const uint32_t sshift =
      arg_u32(argc > 1 ? argv[1] : NULL, (p <= 5U) ? 1U : 0U) ? 1U : 0U;
   const uint32_t dlyb_sel = arg_u32(argc > 2 ? argv[2] : NULL, 0U);
   const uint32_t dlyb_unit =
      dlyb_sel ? arg_u32(argc > 3 ? argv[3] : NULL, 0x7FU) : 0U;
   if (qspi_set_dlyb(dlyb_sel, dlyb_unit) != HAL_OK) {
      my_printf("ERR dlyb range\r\n");
      return;
   }
   if (qspi_init(p, qspi_get_fsize(), qspi_get_csht(), sshift, false)
       != HAL_OK) {
      my_printf("ERR reinit\r\n");
      return;
   }
   busy_flag = true;
   my_printf("presc=%lu sshift=%lu dlyb=%lu unit=%lu\r\n",
             (unsigned long)p, (unsigned long)sshift,
             (unsigned long)dlyb_sel, (unsigned long)dlyb_unit);
}

/* -------- raw GPIO bring-up helpers ------------------------------- */

struct pin_def {
   GPIO_TypeDef *port;
   uint32_t      pin;
   const char   *name;
};

static const struct pin_def pins[6] = {
   { QSPI_CLK_PORT, QSPI_CLK_PIN, "CLK" },
   { QSPI_NCS_PORT, QSPI_NCS_PIN, "NCS" },
   { QSPI_IO0_PORT, QSPI_IO0_PIN, "IO0" },
   { QSPI_IO1_PORT, QSPI_IO1_PIN, "IO1" },
   { QSPI_IO2_PORT, QSPI_IO2_PIN, "IO2" },
   { QSPI_IO3_PORT, QSPI_IO3_PIN, "IO3" },
};

#ifdef GPIO_SPEED_FREQ_LOW
#define GPIO_BITBANG_OUTPUT_SPEED GPIO_SPEED_FREQ_LOW
#else
#define GPIO_BITBANG_OUTPUT_SPEED GPIO_SPEED_FREQ_MEDIUM
#endif

static void config_gpio_pin_speed(int i, uint32_t mode, uint32_t speed)
{
   GPIO_InitTypeDef g = {
      .Pin   = pins[i].pin,
      .Mode  = mode,
      .Pull  = GPIO_NOPULL,
      .Speed = speed,
   };
   HAL_GPIO_Init(pins[i].port, &g);
}

static void config_gpio_pin(int i, uint32_t mode)
{
   config_gpio_pin_speed(i, mode, GPIO_SPEED_FREQ_VERY_HIGH);
}

static void config_gpio_bitbang_output(int i)
{
   config_gpio_pin_speed(i, GPIO_MODE_OUTPUT_PP, GPIO_BITBANG_OUTPUT_SPEED);
}

static void force_gpio_outputs(void)
{
   QUADSPI->CR &= ~QUADSPI_CR_EN;
   for (int i = 0; i < 6; i++)
      config_gpio_pin(i, GPIO_MODE_OUTPUT_PP);
}

static void force_gpio_inputs(void)
{
   QUADSPI->CR &= ~QUADSPI_CR_EN;
   for (int i = 0; i < 6; i++)
      config_gpio_pin(i, GPIO_MODE_INPUT);
}

static void gpio_write_idx(int i, uint32_t high)
{
   HAL_GPIO_WritePin(pins[i].port, pins[i].pin,
                     high ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static uint32_t gpio_read_idx(int i)
{
   return HAL_GPIO_ReadPin(pins[i].port, pins[i].pin) == GPIO_PIN_SET;
}

static uint32_t gpio_read_nibble_raw(void)
{
   const uint32_t io0 = (QSPI_IO0_PORT->IDR & QSPI_IO0_PIN) ? 1U : 0U;
   const uint32_t io1 = (QSPI_IO1_PORT->IDR & QSPI_IO1_PIN) ? 1U : 0U;
   const uint32_t io2 = (QSPI_IO2_PORT->IDR & QSPI_IO2_PIN) ? 1U : 0U;
   const uint32_t io3 = (QSPI_IO3_PORT->IDR & QSPI_IO3_PIN) ? 1U : 0U;

   return io0 | (io1 << 1) | (io2 << 2) | (io3 << 3);
}

static void gpio_bitbang_delay(void)
{
   __asm volatile("dsb sy" ::: "memory");
   for (volatile uint32_t i = 0; i < 2000U; i++)
      __asm volatile("nop");
   __asm volatile("dsb sy" ::: "memory");
}

static void gpio_k_settle_delay(void)
{
   for (uint32_t i = 0; i < 8U; i++)
      gpio_bitbang_delay();
}

